{
  "movies": [
    {
      "id": 2,
      "title": "Inception",
      "rating": 14,
      "year": 2010,
      "description": "A thief who enters the dreams of others to steal their secrets must plant an idea into a CEO's mind to secure his freedom."
    },
    {
      "id": 3,
      "title": "The Social Network",
      "rating": 14,
      "year": 2010,
      "description": "Harvard student Mark Zuckerberg creates the social networking site that eventually becomes known as Facebook, but success leads to both personal and legal complications."
    },
    {
      "id": 4,
      "title": "Django Unchained",
      "rating": 14,
      "year": 2012,
      "description": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner."
    },
    {
      "id": 5,
      "title": "Gravity",
      "rating": 14,
      "year": 2013,
      "description": "Two astronauts work together to survive after an accident leaves them stranded in space."
    },
    {
      "id": 6,
      "title": "Birdman",
      "rating": 14,
      "year": 2014,
      "description": "A washed-up actor, who once played an iconic superhero, battles his ego and attempts to recover his family, his career, and himself in the days leading up to the opening of his Broadway play."
    },
    {
      "id": 7,
      "title": "Mad Max: Fury Road",
      "rating": 14,
      "year": 2015,
      "description": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."
    },
    {
      "id": 8,
      "title": "La La Land",
      "rating": 14,
      "year": 2016,
      "description": "While navigating their careers in Los Angeles, a pianist and an actress fall in love while attempting to reconcile their aspirations for the future."
    },
    {
      "id": 9,
      "title": "Get Out",
      "rating": 14,
      "year": 2017,
      "description": "A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point."
    },
    {
      "id": 10,
      "title": "Parasite",
      "rating": 14,
      "year": 2019,
      "description": "A poor family, the Kims, con their way into becoming the servants of a rich family, the Parks. But their easy life gets complicated when their deception is threatened with exposure."
    },
    {
      "id": 11,
      "title": "Joker",
      "rating": 14,
      "year": 2019,
      "description": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated, leading him to embark on a downward spiral of revolution and bloody crime."
    },
    {
      "id": 12,
      "title": "Dune",
      "rating": 14,
      "year": 2021,
      "description": "Feature adaptation of Frank Herbert's science fiction novel, about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy."
    },
    {
      "id": 13,
      "title": "The French Dispatch",
      "rating": 14,
      "year": 2021,
      "description": "A love letter to journalists set in an outpost of an American newspaper in a fictional 20th-century French city that brings to life a collection of stories published in 'The French Dispatch Magazine'."
    }
  ]
}