{
  "movies": [
    {
      "title": "The Dark Knight",
      "year": 2008,
      "description": "A vigilante known as Batman sets ",
      "id": 2
    },
    {
      "id": 3,
      "title": "Pulp Fiction",
      "year": 1994,
      "description": "The lives of two mob hitmen, a boxer, a gangster's wife, and a pair of diner bandits intertwine.",
      "image": "pulp_fiction.jpg",
      "rating": 8.9
    },
    {
      "id": 4,
      "title": "The Shawshank Redemption",
      "year": 1994,
      "description": "Two imprisoned men bond over several years, finding solace and eventual redemption through acts of common decency.",
      "image": "shawshank_redemption.jpg",
      "rating": 9.3
    },
    {
      "id": 5,
      "title": "Fight Club",
      "year": 1999,
      "description": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into much more.",
      "image": "fight_club.jpg",
      "rating": 8.8
    },
    {
      "id": 6,
      "title": "Forrest Gump",
      "year": 1994,
      "description": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate, and other historical events unfold through the perspective of an Alabama man with an IQ of 75.",
      "image": "forrest_gump.jpg",
      "rating": 8.8
    },
    {
      "id": 7,
      "title": "The Matrix",
      "year": 1999,
      "description": "A computer hacker learns about the true nature of his reality and his role in the war against its controllers.",
      "image": "matrix.jpg",
      "rating": 8.7
    },
    {
      "id": 8,
      "title": "Schindler's List",
      "year": 1993,
      "description": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
      "image": "schindlers_list.jpg",
      "rating": 8.9
    },
    {
      "id": 9,
      "title": "The Godfather",
      "year": 1972,
      "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
      "image": "godfather.jpg",
      "rating": 9.2
    },
    {
      "id": 10,
      "title": "Goodfellas",
      "year": 1990,
      "description": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
      "image": "goodfellas.jpg",
      "rating": 8.7
    }
  ]
}